In [17]:
people = {
    "first": ["Onkar",'Yash','Shritej'],
    "Second": ["Galande",'Bangude','Kumbhar'],
    "Email": ["galandeonkar2001@gmail.com",'bangudeyash@gmail.com','kumbharshritya@gmail.com']
}

In [19]:
people['first']

['Onkar', 'Yash', 'Shritej']

In [20]:
people['Second']

['Galande', 'Bangude', 'Kumbhar']

In [21]:
people['Email']

['galandeonkar2001@gmail.com',
 'bangudeyash@gmail.com',
 'kumbharshritya@gmail.com']

In [22]:
df = pd.DataFrame(people)

In [23]:
df

     first   Second                       Email
0    Onkar  Galande  galandeonkar2001@gmail.com
1     Yash  Bangude       bangudeyash@gmail.com
2  Shritej  Kumbhar    kumbharshritya@gmail.com

In [24]:
df["Email"]

0    galandeonkar2001@gmail.com
1         bangudeyash@gmail.com
2      kumbharshritya@gmail.com
Name: Email, dtype: object

In [28]:
df.Email

0    galandeonkar2001@gmail.com
1         bangudeyash@gmail.com
2      kumbharshritya@gmail.com
Name: Email, dtype: object

In [32]:
df[['Second', 'Email']]

    Second                       Email
0  Galande  galandeonkar2001@gmail.com
1  Bangude       bangudeyash@gmail.com
2  Kumbhar    kumbharshritya@gmail.com

In [35]:
df.columns

Index(['first', 'Second', 'Email'], dtype='object')

In [36]:
df.iloc[0]

first                          Onkar
Second                       Galande
Email     galandeonkar2001@gmail.com
Name: 0, dtype: object

In [37]:
df.iloc[[0,1]]

   first   Second                       Email
0  Onkar  Galande  galandeonkar2001@gmail.com
1   Yash  Bangude       bangudeyash@gmail.com

In [38]:
df.iloc[[0,1],0]

0    Onkar
1     Yash
Name: first, dtype: object

In [42]:
df.loc[[0, 1], ['Email', 'first']]

                        Email  first
0  galandeonkar2001@gmail.com  Onkar
1       bangudeyash@gmail.com   Yash